wisp-tests/409/data/attachments/c5b9809fca0d3673.txt

URL: https://api.uat.platform.pagopa.it/nodo/node-for-psp/v1
Request:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header />
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>AGID_01</idPSP>
			<idBrokerPSP>97735020584</idBrokerPSP>
			<idChannel>97735020584_03</idChannel>
			<password>***</password>
			<idempotencyKey>351174442262247262_6230342040</idempotencyKey>
			<qrCode>
				<fiscalCode>15376371009</fiscalCode>
				<noticeNumber>351174442262247262</noticeNumber>
			</qrCode>
			<expirationTime>900000</expirationTime>
			<amount>648.94</amount>
			<paymentNote>5eb3ae0b-215f-469b-9154-9149cef48081</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>
